using System.Collections.Generic;

namespace VodovozInfrastructure
{
	public class InformationHandbook
	{
		public static Dictionary<string, string> OrganizationTypes = new Dictionary<string, string> {
			{ "ООО", "Общество с ограниченной ответственностью" },
			{ "ЗАО", "Закрытое акционерное общество" },
			{ "ОАО", "Открытое акционерное общество" },
			{ "ГорПО", "Городское потребительское общество" },
			{ "РайПО", "Районное потребительское общество" },
			{ "СельПО", "Сельское потребительское общество" },
			{ "НКО", "Некоммерческая организация" },
			{ "ИП", "Индивидуальный предприниматель" },
			{ "ОДО", "Общество с дополнительной ответственностью" },
			{ "ПТ", "Полное товарищество" },
			{ "АО", "Акционерное общество" },
			{ "АК", "Акционерная компания" },
			{ "КТ", "Коммандитное товарищество" },
			{ "ХП", "Хозяйственное партнерство" },
			{ "КФХ", "Крестьянское (фермерское) хозяйство" },
			{ "НП", "Некоммерческое партнерство" },
			{ "ПК", "Потребительский кооператив" },
			{ "ТСН", "Товарищество собственников недвижимости" },
			{ "АНО", "Автономная некоммерческая организация" },
			{ "ФГУП", "Федеральное государственное унитарное предприятие" },
			{ "ГУП", "Государственное унитарное предприятие" },
			{ "МУП", "Муниципальное унитарное предприятие" },
			{ "ГП", "Государственное предприятие" },
			{ "СНТ", "Садоводческое некоммерческое товарищество" },
			{ "ДНТ", "Дачное некоммерческое товарищество" },
			{ "ОНТ", "Огородническое некоммерческое товарищество" },
			{ "СНП", "Садоводческое некоммерческое партнерство" },
			{ "ДНП", "Дачное некоммерческое партнерство" },
			{ "ОНП", "Огородническое некоммерческое партнерство" },
			{ "СПК", "Садоводческий потребительский кооператив" },
			{ "ДПК", "Дачный потребительский кооператив" },
			{ "ОПК", "Огороднический потребительский кооператив" },
			{ "ГБПОУ", "Государственное бюджетное профессиональное образовательное учреждение" },
			{ "МБУ", "Муниципальное бюджетное учреждение" },
			{ "ФБУН", "Федеральное бюджетное учреждение науки" },
			{ "ГБУ ЛО", "Государственное бюджетное учреждение ленинградской области" },
			{ "ГБУ", "Государственное бюджетное учреждение" },
			{ "ПАО", "Публичное акционерное общество" },
			{ "ФКП", "Федеральное казенное предприятие" },
			{ "АМО", "Администрация муниципального образования" },
			{ "МКУ", "Муниципальное казенное учреждение" },
			{ "МС", "Муниципальный совет" },
			{ "МА", "Местная администрация" },
			{ "СПБГБУ", "Санкт-Петербургское государственное бюджетное учреждение" },
			{ "СПБГАУК", "Санкт-Петербургское государственное автономное учреждение культуры" },
			{ "СПБГБУК", "Санкт-Петербургское государственное бюджетное учреждение культуры" },
			{ "ФГБУН", "Федеральное государственное бюджетное учреждение науки" },
			{ "МКУК", "Муниципальное казенное учреждение культуры" }
		};
	}
}
